"espk" = "Θύρα ηχείων Apple";
"ispk" = "Ενσωματωμένο";
"emic" = "Θύρα μικροφώνου";
"imic" = "Ενσωματωμένο";
"hdpn" = "Θύρα ακουστικών";
"lini" = "Θύρα γραμμής εισόδου ήχου";
"lino" = "Θύρα γραμμής εξόδου ήχου";
"spdi" = "Θύρα οπτικής ψηφιακής εισόδου";
"spdo" = "Θύρα οπτικής ψηφιακής εξόδου";
"pci " = "Κάρτα PCI";
"usb " = "USB";
"1394" = "FireWire";
"wrls" = "AirPort";
"ntwk" = "Δικτυακή συσκευή";
"blue" = "Bluetooth";
"bluh" = "Ακουστικά Bluetooth";
"blus" = "Σετ κεφαλής Bluetooth";
"dprt" = "DisplayPort";
"hdmi" = "HDMI";
"airp" = "AirPlay";
